In [31]:
person = {
    "first": "Corey", 
    "last": "Schafer", 
    "email": "CoreyMSchafer@gmail.com"
}

In [32]:
people = {
    "first": ["Corey"], 
    "last": ["Schafer"], 
    "email": ["CoreyMSchafer@gmail.com"]
}

In [33]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [34]:
people["email"]

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [35]:
import pandas as pd

In [36]:
df = pd.DataFrame(people)

In [37]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [38]:
df["email"] #more secure way to access data. Dotnotation has possibility to use attributes instead#

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [39]:
df.email #easyer way but has a risk to have an attributes name as a colum ie. object#

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [40]:
df[["last","email"]] #list inside brakets/ filtered out df

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [41]:
df.columns # gives all columns

Index(['first', 'last', 'email'], dtype='object')

In [42]:
df.iloc[0] #iloc = integer location. Returns series that shows first rows values

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [43]:
df.iloc[[0,1], 1] #spesifies columns to show. But only using integers, not column name

0    Schafer
1        Doe
Name: last, dtype: object

In [44]:
df.loc[[0,1], ["last", "first"]] #use labes to spesify rows

      last  first
0  Schafer  Corey
1      Doe   Jane

In [45]:
df["email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [46]:
df.set_index("email") #Shows email as index

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [47]:
df.set_index("email", inplace=True) #Sets Email as index

In [48]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [49]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [50]:
df.loc["CoreyMSchafer@gmail.com", "last"] #Checks the info of the spesific row

'Schafer'

In [51]:
df.loc[0] #if used gives type error because index is not a number anymore

KeyError: 0

In [52]:
df.iloc[0] #Still works becaude iloc uses index as numbers

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [53]:
df.reset_index(inplace=True) # resets the index

In [54]:
df["last"] == "Doe" #Series of true/false values. True values are the rows that met value and false ones that did not. Its called filter mask

0    False
1     True
2     True
Name: last, dtype: bool

In [55]:
filt = (df["last"] == "Doe") #filters the df by the series

In [56]:
df.loc[filt, "email"] #Using loc makes it possible to choose also spesific rows

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [57]:
# & | and and or symbols

In [58]:
filt = (df["last"] == "Doe") & (df["first" ] == "John")

In [59]:
df.loc[filt, "email"]

2    JohnDoe@email.com
Name: email, dtype: object

In [60]:
filt = (df["last"] == "Schafer") | (df["first" ] == "John")

In [61]:
df.loc[filt, "email"]

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [62]:
df.loc[~filt, "email"] #gives the opposite of the filters rows

1    JaneDoe@email.com
Name: email, dtype: object

In [66]:
df.columns = ["first_name", "last_name", "email"] #changes column names

In [65]:
df

                first_name last_name    email
0  CoreyMSchafer@gmail.com     Corey  Schafer
1        JaneDoe@email.com      Jane      Doe
2        JohnDoe@email.com      John      Doe

In [69]:
df.columns = [x.upper() for x in df.columns] #sets columns to uppercase

In [68]:
df

                FIRST_NAME LAST_NAME    EMAIL
0  CoreyMSchafer@gmail.com     Corey  Schafer
1        JaneDoe@email.com      Jane      Doe
2        JohnDoe@email.com      John      Doe

In [71]:
df.columns = df.columns.str.replace(" ", "_") #replaces spaces with underscores

In [74]:
df.rename(columns={"FIRST_NAME" : "FIRST", "LAST_NAME": "LAST"}, inplace=True ) #changes spesific columnnames

In [73]:
df

                     FIRST   LAST    EMAIL
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [77]:
df.loc[2] #gives row 2 using index

FIRST    JohnDoe@email.com
LAST                  John
EMAIL                  Doe
Name: 2, dtype: object

In [80]:
df.loc[2] = ["John", "Smith", "JohnSmith@gmail.com"] # changes columns in the row

In [79]:
df

                     FIRST   LAST                EMAIL
0  CoreyMSchafer@gmail.com  Corey              Schafer
1        JaneDoe@email.com   Jane                  Doe
2                     John  Smith  JohnSmith@gmail.com

In [83]:
df.loc[2, ["LAST", "EMAIL"]] = [ "Doe", "DoeSmith@gmail.com"] #changes spesific columns

In [82]:
df

                     FIRST   LAST               EMAIL
0  CoreyMSchafer@gmail.com  Corey             Schafer
1        JaneDoe@email.com   Jane                 Doe
2                     John    Doe  DoeSmith@gmail.com

In [86]:
df.loc[2, "LAST"] = "Rogan" # changes just one column

In [85]:
df

                     FIRST   LAST               EMAIL
0  CoreyMSchafer@gmail.com  Corey             Schafer
1        JaneDoe@email.com   Jane                 Doe
2                     John  Rogan  DoeSmith@gmail.com

In [88]:
df.at[2, "LAST"] = "Rogan" # changes just one column the same way .loc

In [92]:
filt = (df['EMAIL'] == 'DoeSmith@gmail.com')
df.loc[filt, 'LAST'] = 'Doe' #uses filter and then changes the item

In [93]:
df

                     FIRST   LAST               EMAIL
0  CoreyMSchafer@gmail.com  Corey             Schafer
1        JaneDoe@email.com   Jane                 Doe
2                     John    Doe  DoeSmith@gmail.com

In [98]:
df["EMAIL"]= df["EMAIL"].str.lower()

In [103]:
df["EMAIL"].apply(len) #Checks the length of a column

0     7
1     3
2    18
Name: EMAIL, dtype: int64

In [104]:
def update_email(email):
    return email.upper()

In [108]:
df["EMAIL"].apply(update_email) #makes a series of emails in uppercase but does not change them

0               SCHAFER
1                   DOE
2    DOESMITH@GMAIL.COM
Name: EMAIL, dtype: object

In [111]:
df["EMAIL"] = df["EMAIL"].apply(update_email) #actually changes the emails

In [110]:
df

                     FIRST   LAST               EMAIL
0  CoreyMSchafer@gmail.com  Corey             SCHAFER
1        JaneDoe@email.com   Jane                 DOE
2                     John    Doe  DOESMITH@GMAIL.COM

In [114]:
df["EMAIL"] = df["EMAIL"].apply(lambda x: x.lower()) #does the same thing

In [116]:
df.apply(len) #Shows lenght function of each column(series)

FIRST    3
LAST     3
EMAIL    3
dtype: int64

In [118]:
len(df["EMAIL"]) #spesific column

3

In [120]:
df.apply(len, axis="columns") #cheks rows not columns

0    3
1    3
2    3
dtype: int64

In [121]:
df.apply(pd.Series.min)

FIRST    CoreyMSchafer@gmail.com
LAST                       Corey
EMAIL                        doe
dtype: object

In [124]:
df.apply(lambda x: x.min())

FIRST    CoreyMSchafer@gmail.com
LAST                       Corey
EMAIL                        doe
dtype: object

In [126]:
df.map(len)

   FIRST  LAST  EMAIL
0     23     5      7
1     17     4      3
2      4     3     18

In [129]:
df.map(str.lower) #makes all strings to lowercase// if values are only strings

                     FIRST   LAST               EMAIL
0  coreymschafer@gmail.com  corey             schafer
1        janedoe@email.com   jane                 doe
2                     john    doe  doesmith@gmail.com

In [134]:
df["FIRST"].map({"coreymschafer@gmail.com": "Crish", "janedoe@email.com	": "Mary"})

0    NaN
1    NaN
2    NaN
Name: FIRST, dtype: object

In [135]:
df

                     FIRST   LAST               EMAIL
0  CoreyMSchafer@gmail.com  Corey             schafer
1        JaneDoe@email.com   Jane                 doe
2                     John    Doe  doesmith@gmail.com

In [136]:
data = {'FIRST': ['coreymschafer@gmail.com', 'janedoe@email.com', 'john'],
        'LAST': ['corey', 'jane', 'doe'],
        'EMAIL': ['schafer', 'doe', 'doesmith@gmail.com']}
df = pd.DataFrame(data)

In [137]:
df

                     FIRST   LAST               EMAIL
0  coreymschafer@gmail.com  corey             schafer
1        janedoe@email.com   jane                 doe
2                     john    doe  doesmith@gmail.com

In [138]:
for index, row in df.iterrows():
    email, first, last = row['FIRST'], row['LAST'], row['EMAIL']
    df.at[index, 'FIRST'] = first if '@' not in email else email
    df.at[index, 'LAST'] = last if '@' not in email else first
    df.at[index, 'EMAIL'] = email if '@' not in email else last

In [140]:
df(print)

TypeError: 'DataFrame' object is not callable

In [142]:
df.at[0, 'FIRST'] = "Corey"

In [143]:
df

               FIRST                LAST    EMAIL
0              Corey               corey  schafer
1  janedoe@email.com                jane      doe
2                doe  doesmith@gmail.com     john

In [144]:
df.at[0, 'LAST'] = "Schafer"

In [145]:
df

               FIRST                LAST    EMAIL
0              Corey             Schafer  schafer
1  janedoe@email.com                jane      doe
2                doe  doesmith@gmail.com     john

In [146]:
df.at[0, 'EMAIL'] = "coreyschafer@email.com"

In [147]:
df

               FIRST                LAST                   EMAIL
0              Corey             Schafer  coreyschafer@email.com
1  janedoe@email.com                jane                     doe
2                doe  doesmith@gmail.com                    john

In [155]:
df['FIRST'] = df['FIRST'] = df['FIRST'].replace({'Corey': 'Chris', 'janedoe@email.com': 'Mary', "doe": "John"})

In [154]:
df

   FIRST                LAST                   EMAIL
0  Chris             Schafer  coreyschafer@email.com
1   Mary                jane                     doe
2    doe  doesmith@gmail.com                    john

In [156]:
df

   FIRST                LAST                   EMAIL
0  Chris             Schafer  coreyschafer@email.com
1   Mary                jane                     doe
2   John  doesmith@gmail.com                    john

In [163]:
df['EMAIL'] = df['EMAIL'] = df['EMAIL'].replace({'Corey': 'Chris', 'doe': 'maryjane@email.com', "john": "johndoe@email.com"})

In [158]:
df

   FIRST   LAST                   EMAIL
0  Chris  Chris  coreyschafer@email.com
1   Mary   Mary                     doe
2   John   John                    john

In [164]:
df

   FIRST   LAST                   EMAIL
0  Chris  Chris  coreyschafer@email.com
1   Mary   Mary      maryjane@email.com
2   John   John     johndoe@email.com\t

In [165]:
df.at[1, 'LAST'] = "Doe"

In [166]:
df

   FIRST   LAST                   EMAIL
0  Chris  Chris  coreyschafer@email.com
1   Mary    Doe      maryjane@email.com
2   John   John     johndoe@email.com\t

In [167]:
df.at[1, 'LAST'] = "Doe"

In [168]:
df

   FIRST   LAST                   EMAIL
0  Chris  Chris  coreyschafer@email.com
1   Mary    Doe      maryjane@email.com
2   John    Doe     johndoe@email.com\t

In [175]:
df.at[0, 'FIRST'] = "Corey"

In [176]:
df

   FIRST     LAST                   EMAIL    FIRTS
0  Corey  Schafer  coreyschafer@email.com  Schafer
1   Mary      Doe      maryjane@email.com      nan
2   John      Doe     johndoe@email.com\t      nan

In [177]:
df.at[2, 'EMAIL'] = "johndoe@email.com"

In [178]:
df

   FIRST     LAST                   EMAIL    FIRTS
0  Corey  Schafer  coreyschafer@email.com  Schafer
1   Mary      Doe      maryjane@email.com      nan
2   John      Doe       johndoe@email.com      nan

In [179]:
df.drop("FIRTS", axis=1, inplace=True)

In [180]:
df

   FIRST     LAST                   EMAIL
0  Corey  Schafer  coreyschafer@email.com
1   Mary      Doe      maryjane@email.com
2   John      Doe       johndoe@email.com